[
  {
    "word": "ameliorated",
    "meaning": "improved, enhanced",
    "desc": "",
    "sentence": "After his monetary help, his situation ameliorated a lot."
  },
  {
    "word": "exacerbated",
    "meaning": "worsened",
    "desc": "",
    "sentence": "Her health exacerbated day by day."
  },
  {
    "word": "relentless",
    "meaning": "persistent, not moved easily",
    "desc": "",
    "sentence": "His fame was the result of his relentless hard work."
  },
  {
    "word": "temperance",
    "meaning": "moderate, in control, abstaining excess",
    "desc": "",
    "sentence": "Temperance in appetite is one of the key factors to stay healthy."
  },
  {
    "word": "providential",
    "meaning": "opportune, occurring at a favourable time",
    "desc": "",
    "sentence": "A providential wind carried raft to the shore."
  },
  {
    "word": "tumultuous",
    "meaning": "chaotic, disorder",
    "desc": "",
    "sentence": "The war left a totally tumultuous situation in the city."
  },
  {
    "word": "trifling",
    "meaning": "trivial, not worth considering",
    "desc": "",
    "sentence": "Fortunately, the stormy waves caused trifling damage to the boat."
  },
  {
    "word": "precariously",
    "meaning": "dangerously",
    "desc": "",
    "sentence": "The guy drove the case so precariously, that I thought this was my last day."
  },
  {
    "word": "harbingers",
    "meaning": "things signalling to an event",
    "desc": "",
    "sentence": "These small attacks are the harbingers of the war."
  },
  {
    "word": "apathy",
    "meaning": "lack of interest",
    "desc": "",
    "sentence": "His apathy was explaining that he had a lot of other things in priority."
  },
  {
    "word": "affability",
    "meaning": "quality of having a friendly manner",
    "desc": "",
    "sentence": "Her affability was the reason of her win in elections."
  },
  {
    "word": "rife",
    "meaning": "a common occurrence, widespread (usually in a negative way)",
    "desc": "",
    "sentence": "Dengue was a rife in medieval days."
  },
  {
    "word": "incongruous",
    "meaning": "appearing strange or wrong, unusual from general",
    "desc": "",
    "sentence": "Unfortunately, his actions were totally incongruous with the situation."
  },
  {
    "word": "equitable",
    "meaning": "able to treat equally, fair, impartial",
    "desc": "",
    "sentence": "A teacher should be equitable always."
  },
  {
    "word": "fortuitous",
    "meaning": "fluke, by chance",
    "desc": "",
    "sentence": "The company's eminent rise was mostly fortuitous, not because of skills of the CEO."
  },
  {
    "word": "didacticism",
    "meaning": "giving more importance to instruction then entertainment or art",
    "desc": "",
    "sentence": "I found her novel full of didacticism."
  },
  {
    "word": "iconoclasm",
    "meaning": "the actions of attacking or destroying the religious beliefs and monuments",
    "desc": "",
    "sentence": "Glory of India was tarnished due to lot of foreign iconoclasts conquering India."
  },
  {
    "word": "fastidiousness",
    "meaning": "paying attention to every small detail, try to be very accurate",
    "desc": "",
    "sentence": "Due to his fastidiousness, he rarely managed to submit his project on time."
  },
  {
    "word": "corroborating",
    "meaning": "validating a theory by providing evidence",
    "desc": "",
    "sentence": "The witness corroborated the way murder took place."
  },
  {
    "word": "debunking",
    "meaning": "to expose a sham",
    "desc": "",
    "sentence": "The officer's investigation debunked the minister's fraudulent actions."
  },
  {
    "word": "capricious",
    "meaning": "unpredictable, volatile, fickle",
    "desc": "",
    "sentence": "I'm very afraid of his capricious behaviour because I can't prepare myself to react to his actions.<br>Closer analysis shows that the motif does not appear as a random or capricious feature but follows a pattern."
  },
  {
    "word": "deemed",
    "meaning": "considered",
    "desc": "",
    "sentence": "The school was deemed as the best school of the town."
  },
  {
    "word": "copious",
    "meaning": "abundant in supply or quantity",
    "desc": "",
    "sentence": "India is blessed with copious amount of water in form of rivers."
  },
  {
    "word": "acerbic",
    "meaning": "highly critical, sarcastic, caustic, bitter in taste",
    "desc": "",
    "sentence": "After it he'd become withdrawn and moody, turning his formerly friendly nature into acerbic and harsh one."
  },
  {
    "word": "scathing",
    "meaning": "bitterly severe, very criticizing",
    "desc": "",
    "sentence": "He couldn't stop scathing about my speech, which discouraged me totally."
  },
  {
    "word": "meticulous",
    "meaning": "extremely careful, fussy, trying to be very precise",
    "desc": "",
    "sentence": "My mother is very meticulous about organizing things in my room."
  },
  {
    "word": "stinginess",
    "meaning": "penny pinching, mean, trying to not use money",
    "desc": "",
    "sentence": "No one goes out with her due to her stinginess."
  },
  {
    "word": "diffident",
    "meaning": "showing modesty, lacking self-confidence",
    "desc": "",
    "sentence": "You shouldn't be so diffident about your achievements, you have done really well.<br>He is very diffident about his success."
  },
  {
    "word": "frugality",
    "meaning": "using money in a well managed manner, economical, thrift",
    "desc": "",
    "sentence": "There is nothing wrong in being frugal until it doesn't turn into stinginess."
  },
  {
    "word": "clandestine",
    "meaning": "secret, kept hidden",
    "desc": "",
    "sentence": "She was not at all aware of his clandestine intentions."
  },
  {
    "word": "objective",
    "meaning": "neutral, disinterested, no feelings attached",
    "desc": "",
    "sentence": "I'm actually objective about politics."
  },
  {
    "word": "utopian",
    "meaning": "idealistic but usually impractical, quixotic",
    "desc": "",
    "sentence": "I understand your point, but these ideas are very utopian in today''s world."
  },
  {
    "word": "pragmatic",
    "meaning": "practical, utilitarian",
    "desc": "",
    "sentence": "In business, the pragmatic approach to problems is more successful than an idealistic one."
  },
  {
    "word": "ubiquity",
    "meaning": "omnipresent, state of being present everywhere at once",
    "desc": "",
    "sentence": "Technology is ubiquity nowadays."
  },
  {
    "word": "soporific",
    "meaning": "inducing sleep, related to sleep",
    "desc": "",
    "sentence": "The drug had already mentioned about its soporific effects."
  },
  {
    "word": "esoteric",
    "meaning": "rare, understood by only selected set of people (inner circle)",
    "desc": "",
    "sentence": "Many students couldn't follow with professor's esoteric references."
  },
  {
    "word": "rebuttal",
    "meaning": "argument",
    "desc": "",
    "sentence": "It was easy for him to win people's hearts by specious rebuttals."
  },
  {
    "word": "anomaly",
    "meaning": "deviating from normal, abnormal",
    "desc": "",
    "sentence": "A parsimonious guy in their family is really an anomaly."
  },
  {
    "word": "catalyst",
    "meaning": "event/element to cause/trigger sudden change",
    "desc": "",
    "sentence": "The riots were later seen as catalyst for the new political developments."
  },
  {
    "word": "cacophony",
    "meaning": "harsh noise",
    "desc": "",
    "sentence": "The classroom filled with cacophony of students."
  },
  {
    "word": "mollify",
    "meaning": "pacify, to calm down",
    "desc": "",
    "sentence": "The host mollified the guests with drinks, before announcing his proposal.<br>She managed to mollify her boss."
  },
  {
    "word": "placate",
    "meaning": "to pacify by providing certain concession",
    "desc": "",
    "sentence": "The government finally placated the farmers by agreeing to some of their demands."
  },
  {
    "word": "gainsay",
    "meaning": "being against, to oppose, to contradict",
    "desc": "",
    "sentence": "No one had audacity to gainsay him, as he was most revered person of the company."
  },
  {
    "word": "burgeon",
    "meaning": "to grow quickly",
    "desc": "",
    "sentence": "The love started to burgeon between them.<br>She burgeoned to a fine actress."
  },
  {
    "word": "precipitate",
    "meaning": "downpour, to bring sudden change",
    "desc": "",
    "sentence": "War precipitated poverty in whole country."
  },
  {
    "word": "forgiving",
    "meaning": "merciful",
    "desc": "",
    "sentence": "I'm of a forgiving nature. I can't remain angry on someone for so long."
  },
  {
    "word": "personable",
    "meaning": "having pleasant personality",
    "desc": "",
    "sentence": "He was so personable on the TV."
  },
  {
    "word": "munificent",
    "meaning": "generous",
    "desc": "",
    "sentence": "I'm happy to get munificent gifts from my friends on my birthday."
  },
  {
    "word": "innocuous",
    "meaning": "harmless, not injurious to health",
    "desc": "",
    "sentence": "Don't be angry. His comments were totally innocuous."
  },
  {
    "word": "anodyne",
    "meaning": "not likely to cause offence, capabilities of relieving pain",
    "desc": "",
    "sentence": "The quarterly meetings in company were anodyne affairs."
  },
  {
    "word": "mettlesome",
    "meaning": "ready to face danger",
    "desc": "",
    "sentence": "The guy has to be mettlesome, if he wants to go in army."
  },
  {
    "word": "congenial",
    "meaning": "compatible, providential, suitable to your needs",
    "desc": "A congenial person is easy to get along with.",
    "sentence": "The department provides very congenial environment for the research."
  },
  {
    "word": "inured",
    "meaning": "accustomed, habitual",
    "desc": "",
    "sentence": "The poverty has inured beggars to hardship."
  },
  {
    "word": "prescient",
    "meaning": "predicting something",
    "desc": "",
    "sentence": "The scientists have been prescient about some disasters due to advancement in technology."
  },
  {
    "word": "aesthetic",
    "meaning": "relating to the outer beauty",
    "desc": "",
    "sentence": "The chair is comfortable, but not aesthetic."
  },
  {
    "word": "gregarious",
    "meaning": "liking companionship, sociable, living in a group",
    "desc": "",
    "sentence": "She get bored being alone due to her gregarious nature."
  },
  {
    "word": "ascetic",
    "meaning": "having strong self control, renouncing the luxuries for religious reasons",
    "desc": "",
    "sentence": "The billionaire quit his company to live an ascetic life."
  },
  {
    "word": "malign",
    "meaning": "evil, harmful in nature",
    "desc": "",
    "sentence": "I wasn't aware of his malign intentions."
  },
  {
    "word": "indignant",
    "meaning": "angered at wrong or unjust things",
    "desc": "When you're indignant, you're angry about an unfair situation.",
    "sentence": "I was indignant because I was punished unfairly."
  },
  {
    "word": "mendacious",
    "meaning": "false, lying habitually, untruthful,",
    "desc": "A mendacious person is one who tells lies habitually and intentionally",
    "sentence": "That toothpaste advertisement was quite mendacious."
  },
  {
    "word": "nugatory",
    "meaning": "worthless, having no value",
    "desc": "Something nugatory has no real value; it’s worthless.",
    "sentence": "All your excuses for not completing your homework are nugatory."
  },
  {
    "word": "derogatory",
    "meaning": "disrespectful, insulting",
    "desc": "If you make derogatory comments, that means you say things that are unflattering, unkind, or demeaning.",
    "sentence": "You have no right to give that kind of derogatory remarks to the teacher."
  },
  {
    "word": "repulsive",
    "meaning": "offensive to mind, something that disgusts you",
    "desc": "If something's repulsive, it's so disgusting you don't want to go near it.",
    "sentence": "I found that villain quite repulsive."
  },
  {
    "word": "incendiary",
    "meaning": "ability to catch fire, provoking rebellion",
    "desc": "An incendiary element is likely to produce an explosion of one kind (literal) or another (figurative).",
    "sentence": "By being strongly radical, he rose as an incendiary figure in the country."
  },
  {
    "word": "pernicious",
    "meaning": "extremely harmful",
    "desc": "Pernicious means harmful and subtle.",
    "sentence": "Laptops and mobiles are pernicious when used immediately after eye surgery."
  },
  {
    "word": "tremulous",
    "meaning": "causing shivers due to fear",
    "desc": "Something tremulous is shaky and quivering, usually from fear or lack of strength.",
    "sentence": "My hands were a bit tremulous at my first big job interview."
  },
  {
    "word": "nescient",
    "meaning": "lacking knowledge, unbelieving",
    "desc": "If you are nescient, you don't believe in spiritual or supernatural powers. If you are nescient in a domain, you don't have knowledge in that domain.",
    "sentence": "Being nescient in literature, you shouldn't be insolent for that author."
  },
  {
    "word": "perturbing",
    "meaning": "deeply disturbing, deviating from a regular route",
    "desc": "If any event is perturbing, it is greatly distressful and worrying",
    "sentence": "My father's death was perturbing for my sister."
  },
  {
    "word": "unnerving",
    "meaning": "inspiring fear",
    "desc": "Use the adjective unnerving to describe situations and experiences that cause you to lose your courage.",
    "sentence": "A walk in cemetery is quite unnerving for many people."
  },
  {
    "word": "obsequious",
    "meaning": "being a yesman, attempting to win favour by flattery, bootlicker",
    "desc": "Obsequious people are usually not being genuine; they resort to flattery and other fawning ways to stay in the good graces of authority figures.",
    "sentence": "The minister was always surrounded by obsequious people who would be overly submissive to him."
  },
  {
    "word": "fawning",
    "meaning": "to win favour by flattery, obsequious",
    "desc": "Use fawning to describe someone who's over the top in the flattery department.",
    "sentence": "The servant worn a fawning smile."
  },
  {
    "word": "servile",
    "meaning": "fawning in attitude, submissive",
    "desc": "Servile describes someone who is so eager to please that it makes you cringe.",
    "sentence": "She was always servile when it came to pleasing the boss."
  },
  {
    "word": "lucid",
    "meaning": "very clear, easy to understand, translucent",
    "desc": "Something that's lucid is clear and understandable.",
    "sentence": "She became a famous journalist due to her lucid writing; readers were able to easily grasp and understand her thoughts."
  },
  {
    "word": "maverick",
    "meaning": "someone who exhibits great independence in thought and actions, rebel",
    "desc": "A maverick is a rebel, someone who shows a lot of independence.",
    "sentence": "She is quite young and a maverick politician."
  },
  {
    "word": "ephemeral",
    "meaning": "not long lasting, temporary",
    "desc": "Something that is fleeting or short-lived is ephemeral.",
    "sentence": "Overnight fame is usually ephemeral."
  },
  {
    "word": "specious",
    "meaning": "plausible but false, attractive but deceptive",
    "desc": "Use specious to describe an argument that seems to be good, correct, or logical, but is not so.",
    "sentence": "We live on earth, therefore earth has to be center of universe has been proven as specious theory of solar system."
  },
  {
    "word": "decorum",
    "meaning": "disciplined, dignified",
    "desc": "Decorum is proper and polite behavior.",
    "sentence": "Students are requested to maintain decorum of the class."
  },
  {
    "word": "cataclysmic",
    "meaning": "catastrophic, severely destructive",
    "desc": "Something that’s cataclysmic is violently destructive. The word often refers to natural disasters, like a cataclysmic earthquake, but cataclysmic can describe other events as well as long as they’re bad enough, like the cataclysmic failure you had making meatloaf.",
    "sentence": "The consequences of this war would be cataclysmic."
  },
  {
    "word": "eulogy",
    "meaning": "a speech for expressing gratitude (mostly for person who has died recently)",
    "desc": "At every funeral, there comes a moment when someone speaks about the life of the person who died. The speaker is delivering what is known as a eulogy. A eulogy is a formal speech that praises a person who has died.",
    "sentence": "Daughter's eulogy on her father's funeral was very emotional."
  },
  {
    "word": "caustic",
    "meaning": "severely criticizing, chemical capable of burning living tissue, acerbic",
    "desc": "Use the adjective caustic to describe any chemical that is able to burn living tissue or other substances, or, figuratively, a statement that has a similarly burning effect. Caustic in this sense means harshly critical.",
    "sentence": "The caustic remarks for each other started a long fight between 2 siblings."
  },
  {
    "word": "efficacy",
    "meaning": "effectiveness, ability to produce desired outcome",
    "desc": "The degree to which a method or medicine brings about a specific result is its efficacy.",
    "sentence": "The efficacy of demonetisation depends on the diligence of bank managers."
  },
  {
    "word": "deference",
    "meaning": "respectful submission",
    "desc": "When you show deference to someone, you make a gesture of respect.",
    "sentence": "The prince bowed with deference in front of the princess."
  },
  {
    "word": "propitious",
    "meaning": "providential, being a favourable circumstance",
    "desc": "When the timing of something is propitious, it's likely to turn out well.",
    "sentence": "The minister's debunked scam was propitious for opposition in winning the upcoming elections."
  },
  {
    "word": "bolster",
    "meaning": "to support",
    "desc": "To bolster is to offer support or strengthen.",
    "sentence": "The evidence bolstered theory of the accused."
  },
  {
    "word": "aggrandize",
    "meaning": "to enlarge the scope",
    "desc": "The verb aggrandize not only means \"to make appear greater\"; it can also be used to mean simply \"to make greater.\" ",
    "sentence": "The lecture truly aggrandized my understanding of physics."
  },
  {
    "word": "ingenuous",
    "meaning": "artless, guileless, naive",
    "desc": "Someone who is ingenuous shows a childlike innocence, trust, and openness.",
    "sentence": "Hostel life is very tough for ingenuous people who are naive and artless."
  },
  {
    "word": "audacious",
    "meaning": "extremely bold and daring, unrestrained",
    "desc": "If you are audacious, you are daring and unconventional!",
    "sentence": "Her preposition was an audacious one, but she knew that the daring would pay off."
  },
  {
    "word": "onerous",
    "meaning": "burdensome, obligations that outweigh advantages",
    "desc": "If something is onerous, it is very difficult to deal with or do.",
    "sentence": "The requirements laid down in the contract where quite onerous given that what little money she would receive."
  },
  {
    "word": "ostentatious",
    "meaning": "meant to show off, intended to attract and impress",
    "desc": "When a thing is ostentatious, that means its present to flaunt and show off.",
    "sentence": "She never missed to wear that ostentatious necklace to the parties."
  },
  {
    "word": "insalubrious",
    "meaning": "unhealthy",
    "desc": "Insalubrious is a formal way to say something is bad for your health.",
    "sentence": "Smoking is insalubrious."
  },
  {
    "word": "unwholesome",
    "meaning": "unhealthy, detrimental to physical or moral well being.",
    "desc": "",
    "sentence": "Everything in excess is unwholesome for us."
  },
  {
    "word": "prodigal",
    "meaning": "who spends resources (usually money) recklessly, spendthrift",
    "desc": "Use the adjective prodigal to describe someone who spends too much money, or something very wasteful.",
    "sentence": "Your prodigal spending on fancy coffee might not leave money for your lunch."
  },
  {
    "word": "diatribe",
    "meaning": "sharply abusing, rant, verbal attack",
    "desc": "A diatribe is an angry, critical speech.",
    "sentence": "The moment I asked her if she would like chicken, she started her diatribe about evils of eating meat."
  },
  {
    "word": "tirade",
    "meaning": "very long criticism, diatribe",
    "desc": "A tirade is a speech, usually consisting of a long string of violent, emotionally charged words.",
    "sentence": "As soon as my mother entered my room, its uncleanliness precipitated a tirade."
  },
  {
    "word": "antipathy",
    "meaning": "strong dislike",
    "desc": "An antipathy is a deep-seated dislike of something or someone. ",
    "sentence": "Barking of dogs fueled his antipathy towards them."
  },
  {
    "word": "torpor",
    "meaning": "apathy due to lethargy, a state of physical inactivity",
    "desc": "Torpor can be used in everyday speech, but it's also a scientific term for a state of deep sleep that allows animals to conserve energy.",
    "sentence": "Humans into a torpor usually after a large meal and on most Monday mornings."
  },
  {
    "word": "reverent",
    "meaning": "respectful, showing veneration",
    "desc": "When you have great awe and respect for someone or something, and you show it by respectfully worshiping that person, thing, deity, or musical group, you are being reverent.",
    "sentence": "This artist was reverent across whole country."
  },
  {
    "word": "loquacious",
    "meaning": "very talkative",
    "desc": "A loquacious person talks a lot, often about stuff that only they think is interesting.",
    "sentence": "He is very loquacious unlike his brother who talks very less."
  },
  {
    "word": "assuage",
    "meaning": "mitigate, make less severe, mollify, satisfy",
    "desc": "If you assuage an unpleasant feeling, you make it go away.The most common things that we assuage are fears, concerns, guilt, grief, anxiety, and anger. That makes a lot of sense — these are all things we seek relief from.",
    "sentence": "Only this much food can't assuage my hunger. <br> His words assuaged my fear of fire."
  },
  {
    "word": "amalgamate",
    "meaning": "to blend in, to combine together",
    "desc": "To amalgamate is to combine different things to create something new.",
    "sentence": "The artist was popular because of his amalgamation of western and folk music."
  },
  {
    "word": "venerate",
    "meaning": "to pray as a deity, deeply respectful",
    "desc": "To venerate is to worship, adore, be in awe of.",
    "sentence": "People venerated that veteran actor in South India."
  },
  {
    "word": "condone",
    "meaning": "excuse, overlook, pardon, forgive",
    "desc": "If you condone something, you allow it, approve of it, or at least can live with it.",
    "sentence": "I can't condone that kind of betrayal at any cost."
  },
  {
    "word": "aver",
    "meaning": "assert confidently, maintain",
    "desc": "To aver is to state something or declare something is true. This verb has a serious tone, so you might aver something on a witness stand or you might aver that you won't back down to a challenge.",
    "sentence": "The scientist averred about the catastrophic effects of global warming."
  },
  {
    "word": "intrepid",
    "meaning": "very firm, brave, resolute, mettlesome",
    "desc": "Intrepid is just a fancy word for describing a person or action that is bold and brave.",
    "sentence": "Superheroes are intrepid in their struggle for truth and justice."
  },
  {
    "word": "tractable",
    "meaning": "controllable, easily managed",
    "desc": "A tractable child, meaning he's obedient, flexible, and responds well to directions.",
    "sentence": "I was relieved when the baby turned out to be quite tractable."
  },
  {
    "word": "cogent",
    "meaning": "very convincing, lucid,plausible",
    "desc": "When you make a cogent argument, it means your argument is clear and persuasive.",
    "sentence": "His explanation was cogent enough to understand the situation."
  },
  {
    "word": "sedulous",
    "meaning": "marked by persistent effort, careful",
    "desc": "A sedulous person is someone who works hard and doesn't give up easily.",
    "sentence": "A company is always in search of sedulous persons;"
  },
  {
    "word": "galvanize",
    "meaning": "to inspire, bring excitement in action",
    "desc": "An inspiring speech can galvanize people into making a change.",
    "sentence": "He was galvanized by cheering of crowd."
  },
  {
    "word": "enervate",
    "meaning": "To weaken, mentally and physically drained, flagging",
    "desc": "",
    "sentence": "A three-hour lecture on the history of socks might thrill someone, it would enervate most people."
  },
  {
    "word": "vacillate",
    "meaning": "fluctuate, indecisiveness",
    "desc": "Vacillate means to waver back and forth, unable to decide.",
    "sentence": "She always vacillates between blue and red T-shirts."
  },
  {
    "word": "abate",
    "meaning": "To weaken, diminish",
    "desc": "Something that abates becomes fewer or less intense.",
    "sentence": "Her kind actions abated his anger."
  },
  {
    "word": "convoluted",
    "meaning": "complicated, difficult to understand",
    "desc": "If something is convoluted, it's intricate and hard to understand.",
    "sentence": "The movie has so convoluted plot, that I had to watch it twice to understand it."
  },
  {
    "word": "taciturn",
    "meaning": "who speaks very less, keeping things to himself",
    "desc": "Someone who is taciturn is reserved, not loud and talkative.",
    "sentence": "He is difficult to understand because of his taciturn nature."
  },
  {
    "word": "abomination",
    "meaning": "hate coupled with disgust, abhorrence",
    "desc": "The noun abomination means a thing or action that is vile, vicious or terrible. For example, if you see a neighbor kick an old blind dog that's done nothing wrong, you might remark, \"That kind of cruelty is an abomination!\"",
    "sentence": "His evil actions quite precipitated abomination amongst people."
  },
  {
    "word": "loathing",
    "meaning": "hate coupled with disgust, abomination",
    "desc": "Loathing is a feeling of complete disgust.",
    "sentence": "Going out in rain is very loathing for me."
  },
  {
    "word": "execration",
    "meaning": "loathing, appeal to superpower to inflict evil",
    "desc": "The noun execration means an angry denouncement or curse.",
    "sentence": "The angry warrior execrated the king that he would die brutally."
  },
  {
    "word": "abhorrence",
    "meaning": "abomination, hate coupled with disgust",
    "desc": "",
    "sentence": "His abhorrence of brinjals was from his childhood."
  },
  {
    "word": "obdurate",
    "meaning": "persistent in wrongdoing, adamant, obstinate",
    "desc": "Obdurate is a formal word meaning stubborn.",
    "sentence": "I wanted to marry her, but my parents were obdurate that I should let her go."
  },
  {
    "word": "insolent",
    "meaning": "derogatory, casual disrespect, unrestrained by convention",
    "desc": "Someone who's insolent is either really doing her own thing, even if it goes against what everyone else is doing, or she’s mildly disrespectful.",
    "sentence": "She was very insolent when she refused to get out of the class when teacher told her to."
  },
  {
    "word": "dogma",
    "meaning": "a religious doctrine that is proclaimed as true without proof",
    "desc": "Dogma means the doctrine of belief in a religion or a political system.",
    "sentence": "Sacrificing goats is seriously a brutal dogma."
  },
  {
    "word": "refute",
    "meaning": "prove to be false",
    "desc": "The verb refute is to prove that something is wrong.",
    "sentence": "The witness totally refuted the accuser's theory by describing what he saw."
  },
  {
    "word": "rescind",
    "meaning": "to revoke, take back officially",
    "desc": "Rescind means to cancel or revoke.",
    "sentence": "My boss rescinded his harsh words when the secretary disabused her of the situation."
  },
  {
    "word": "admonish",
    "meaning": "to scold lightly, reprimand",
    "desc": "To admonish is to scold. If you want to show someone you're not happy with his behavior, admonish him.",
    "sentence": "Father admonished the son for staying out late in night."
  },
  {
    "word": "castigate",
    "meaning": "to punish severely, censure severely",
    "desc": "Use castigate when you mean \"to reprimand in an especially harsh way.\"",
    "sentence": "The superior castigated his employees for the blunder that happened in front of client."
  },
  {
    "word": "denigrate",
    "meaning": "charge falsely or with malicious intent; attack the good name and reputation of someone",
    "desc": "To denigrate is to say bad things — true or false — about a person or thing.",
    "sentence": "Famous actresses are most likely to get denigrated by public."
  },
  {
    "word": "disabuse",
    "meaning": "to remove deception, clarify",
    "desc": "Disabuse means to free someone of a belief that is not true.",
    "sentence": "He felt guilty once his brother disabused him from his misunderstanding."
  },
  {
    "word": "exculpate",
    "meaning": "to get free from guilt, exonerate, vindicate",
    "desc": "To exculpate means to find someone not guilty of criminal charges.",
    "sentence": "The man was exculpated from robbery because no evidence was found against him."
  },
  {
    "word": "foment",
    "meaning": "To foster, try to stir up public opinion",
    "desc": "Foment means stirring up something undesirable, such as trouble.",
    "sentence": "His cruel killings fomented the revolt in the city."
  },
  {
    "word": "arduous",
    "meaning": "very tough, needing lot of efforts till the point of exhaustion",
    "desc": "Use the adjective arduous to describe an activity that takes a lot of effort.",
    "sentence": "The ascend to the mountain was indeed arduous."
  },
  {
    "word": "aberrant",
    "meaning": "anomalical, unusual",
    "desc": "Use the adjective aberrant to describe unusual conduct.",
    "sentence": "It isn't good idea to go out in this aberrant weather."
  },
  {
    "word": "volatile",
    "meaning": "unpredictable, fluctuating, liable to lead sudden change",
    "desc": "Watch out when a situation becomes volatile — it is likely to change for the worse suddenly. ",
    "sentence": "Its not good to invest in such volatile market."
  },
  {
    "word": "sporadic",
    "meaning": "irregular, occasional",
    "desc": "Sporadic is an adjective that you can use to refer to something that happens or appears often, but not constantly or regularly.",
    "sentence": "He used to visit his mother sporadically."
  },
  {
    "word": "inchoate",
    "meaning": "just begun, not organised, not fully developed",
    "desc": "Inchoate means just beginning to form. ",
    "sentence": "The simple design for such involved project indicated that it was just an inchoate one."
  },
  {
    "word": "implacable",
    "meaning": "cannot be placated or mollified",
    "desc": "An implacable person just can’t be appeased.",
    "sentence": "His father was quite implacable as he would never forgive his son for even small mistakes."
  },
  {
    "word": "tacit",
    "meaning": "implicit, understood from actions or statements",
    "desc": "Something tacit is implied or understood without question.",
    "sentence": "Holding hands might be a tacit acknowledgement that the boy and girl might be dating."
  },
  {
    "word": "facetious",
    "meaning": "not meant to be taken seriously",
    "desc": "Don’t take a facetious comment seriously because it’s supposed to be funny. Anything facetious is a joke.",
    "sentence": "You can't take that advise in a facetious way!"
  },
  {
    "word": "transient",
    "meaning": "temporary, ephemeral",
    "desc": "Use the adjective transient to describe something that always changes or moves around.",
    "sentence": "Money is transient in life, respect is what remains even after death."
  },
  {
    "word": "quiescent",
    "meaning": "being quiet or inactive",
    "desc": "For example, if a disease is quiescent, you probably won't know you have it.",
    "sentence": "How can you be so quiescent after seeing so much violence?"
  },
  {
    "word": "proliferate",
    "meaning": "to spread quickly, to grow rapidly",
    "desc": "When something proliferates, it's growing, spreading or multiplying really quickly.",
    "sentence": "Corona proliferated whole world this year."
  },
  {
    "word": "desiccate",
    "meaning": "to dry up thoroughly",
    "desc": "The verb desiccate means to dry out, dry up and dehydrate.",
    "sentence": "The washed clothes quickly desiccate in the summers."
  },
  {
    "word": "eschew",
    "meaning": "to renounce, abandon",
    "desc": "If you eschew something, you deliberately avoid it.",
    "sentence": "The king eschewed his lost kingdom overnight."
  },
  {
    "word": "occlude",
    "meaning": "to obstruct",
    "desc": "Occlude means to obstruct, as with an opening.",
    "sentence": "Closed windows occluded the cold and pleasant air."
  },
  {
    "word": "empirical",
    "meaning": "derived from guided experiment or evidence",
    "desc": "If knowledge is empirical, it's based on observation rather than theory.To do an empirical study of donut shops, you'll need to visit every one you can find.",
    "sentence": "Many diseases were empirically treated in olden days."
  },
  {
    "word": "stolid",
    "meaning": "emotionally unmovable, expressionless",
    "desc": "A stolid person can’t be moved to smile or show much sign of life, in much the same way as something solid, like a giant boulder, is immovable.",
    "sentence": "His violent childhood had turned him into a stolid person."
  },
  {
    "word": "intimate",
    "meaning": "very private, to suggest subtly",
    "desc": "Intimate means being close.",
    "sentence": "Her intimate relation with actor was debunked."
  },
  {
    "word": "nonplussed",
    "meaning": "utterly confused, bewildered",
    "desc": "If a conversation with someone leaves you scratching your head and wondering what point they were trying to make, you are nonplussed: bewildered, puzzled, often speechless.",
    "sentence": "I was nonplussed when boss fired me even after I was employee of the month."
  },
  {
    "word": "extant",
    "meaning": "existing (usually for documents)",
    "desc": "Use the adjective extant to describe old things that are still around",
    "sentence": "The Bose papers are still extant after around 70 years."
  },
  {
    "word": "ambivalent",
    "meaning": "having conflicting or mixed feelings",
    "desc": "If you can't decide how you feel about something, declare yourself ambivalent about it.",
    "sentence": "I am always ambivalent on playing games on computers."
  },
  {
    "word": "laconic",
    "meaning": "to say in very few words",
    "desc": "Laconic is an adjective that describes a style of speaking or writing that uses only a few words, often to express complex thoughts and ideas.",
    "sentence": "I admire writers laconic way to express his feelings."
  },
  {
    "word": "intransigent",
    "meaning": "not ready to change, inflexible",
    "desc": "Intransigent means inflexible, stubborn, entrenched.",
    "sentence": "Why are you so intransigent in choosing the accommodation?"
  },
  {
    "word": "upbraid",
    "meaning": "to scold, to criticize",
    "desc": "When you upbraid people, you scold them, tell them off, and criticize them.",
    "sentence": "I upbraided the barber for a bad hair cut."
  },
  {
    "word": "insipid",
    "meaning": "something having no interesting qualities, lacking flavor",
    "desc": "Something insipid is lacking in flavor or interest.",
    "sentence": "The characters of the film were so insipid, I thought I'd die of boredom."
  },
  {
    "word": "pedestrian",
    "meaning": "lacking imagination, prosaic, dull, related to walking",
    "desc": "",
    "sentence": "The movie plot was very pedestrian."
  },
  {
    "word": "hackneyed",
    "meaning": "banal, overly used phrase, cliche",
    "desc": "Hackneyed is a word for language that doesn't pack a punch since it's overused and trite.",
    "sentence": "Every year, we would have to listen that hackneyed speech of our principal on teacher's day."
  },
  {
    "word": "contentious",
    "meaning": "causing quarrel, precipitating controversy",
    "desc": "A contentious issue is one that people are likely to argue about, and a contentious person is someone who likes to argue or fight.",
    "sentence": "The efficacy of various political parties become contentious issue during elections."
  },
  {
    "word": "craven",
    "meaning": "coward, fainthearted",
    "desc": "A craven man is the opposite of mettlesome guys: he has not an ounce of courage.",
    "sentence": "Accomplishing such precarious task is no job for a craven."
  },
  {
    "word": "venality",
    "meaning": "susceptibility to corruption",
    "desc": "Venality is the quality of being open to bribery or overly motivated by money.",
    "sentence": "The underworld mafia rely on venality of police officers to execute their crimes."
  },
  {
    "word": "restive",
    "meaning": "restless,impatient especially under restriction or delay",
    "desc": "To be restive is to be impatient or on edge — it's an edgy state.",
    "sentence": "The crowd went restive when all the jokes came flat on them."
  },
  {
    "word": "betray",
    "meaning": "to show something that was supposed to be hidden",
    "desc": "When you betray someone or something, you provide information whether you mean to do it or not, like the loud growling of your stomach that betrays your hunger or the secret you tell about your friend that betrays her trust",
    "sentence": "His grin lucidly betrayed his intentions."
  },
  {
    "word": "impertinent",
    "meaning": "disrespectful, improperly bold",
    "desc": "If someone's rude without being openly nasty, call him impertinent.",
    "sentence": "How can you be so impertinent with your teacher!"
  },
  {
    "word": "acrimony",
    "meaning": "refers bitterness and ill will",
    "desc": "",
    "sentence": "There existed acrimony between 2 brothers which was propitious for their uncle in having their money."
  },
  {
    "word": "veracious",
    "meaning": "truthful, honest",
    "desc": "Someone who is veracious speaks the truth — like your brutally honest friend who always lets you know what she thinks about your outfits, your hairstyle, your lasagna recipe, and your taste in movies.",
    "sentence": "There is a need of some person who is quite veracious with you in order to ameliorate you."
  },
  {
    "word": "probity",
    "meaning": "honesty, integrity",
    "desc": " It means being morally and ethically above reproach, or having integrity.",
    "sentence": "The success of company depends on probity and alacrity of its employees."
  },
  {
    "word": "alacrity",
    "meaning": "eagerness, cheerfulness",
    "desc": "Someone with alacrity shows cheerful willingness and eager behavior, like a kid whose mother has told him he can buy anything in a candy store.",
    "sentence": "The success of company depends on probity and alacrity to work of its employees."
  },
  {
    "word": "propriety",
    "meaning": "appropriateness to circumstances, suitability, being congenial",
    "desc": "Propriety is following what is socially acceptable in speech and behavior.",
    "sentence": "She doesn't care about propriety of clothes for a particular event."
  },
  {
    "word": "dulcet",
    "meaning": "sweet and soothing sound",
    "desc": "Use the adjective dulcet to describe a sound that is soothing and soft.",
    "sentence": "The artist was famous for his dulcet symphonies."
  },
  {
    "word": "profligate",
    "meaning": "spending resources recklessly",
    "desc": "Profligate, as a noun or as an adjective, implies recklessly wasting your money on extravagant luxury.",
    "sentence": "You can't afford to be a profligate person since your father is no more."
  },
  {
    "word": "parsimonious",
    "meaning": "penny-pinching, not wanting to spend money at all",
    "desc": "A parsimonious person is unwilling to spend a lot of money.",
    "sentence": "No one wants to go to trip with him because of his parsimonious nature."
  },
  {
    "word": "prevaricate",
    "meaning": "be deliberately ambiguous or unclear in order to mislead or withhold information",
    "desc": "When you prevaricate, you lie or mislead.",
    "sentence": "The suspect cleverly prevaricated the story to buy extra time."
  },
  {
    "word": "wanting",
    "meaning": "lacking",
    "desc": "If something's wanting, there's not enough of something necessary in it.",
    "sentence": "He is wanting probity."
  },
  {
    "word": "egregious",
    "meaning": "shockingly bad, very impulsive",
    "desc": "Something that is egregious stands out, but not in a good way — it means \"really bad or offensive.\"",
    "sentence": "Dictator's sometimes take egregious decisions, which indeed shock people."
  },
  {
    "word": "parochial",
    "meaning": "narrowly restricted in scope",
    "desc": "If an issue or a matter is parochial, it is trivial or only concerns a local area. Likewise, a person with a parochial mentality is narrow-minded, or not open to new ideas.",
    "sentence": "Learning technology in poor countries is quite parochial."
  },
  {
    "word": "dissonance",
    "meaning": "harsh sound, disagreement, not in resonance",
    "desc": "",
    "sentence": "The dissonance over their father's will burgeoned acrimony between 2 brothers."
  },
  {
    "word": "harangue",
    "meaning": "long tirade, speech of didactic nature.",
    "desc": "A harangue is more than a speech, louder than a discussion, and nastier than a lecture. It is a verbal attack that doesn't let up, delivered as a verb or received as a noun.",
    "sentence": "After their mischief was caught, students were harangued by the professors."
  },
  {
    "word": "platitude",
    "meaning": "banal, hackneyed phrases, a trite or obvious remark",
    "desc": "",
    "sentence": "His employees might get sick of listening to these meaningless clichés and tell him to cut the platitudes."
  },
  {
    "word": "sycophant",
    "meaning": "person who inveigles, in order to win favour",
    "desc": "A sycophant is a person who tries to win favor from wealthy or influential people by flattering them.",
    "sentence": "The villain was always surrounded by sycophants who expected him to keep them with him."
  },
  {
    "word": "noxious",
    "meaning": "harmful or injurious to health",
    "desc": "Something noxious is harmful and could be even fatal.",
    "sentence": "Smoking is noxious to health."
  },
  {
    "word": "whimsical",
    "meaning": "funny, out of box, unusual, capricious",
    "desc": "Whimsical means full of or characterized by whims, which are odd ideas that usually occur to you very suddenly. ",
    "sentence": "I flew to Europe whimsically as it wasn't at all planned."
  },
  {
    "word": "outstrip",
    "meaning": "Get ahead of other, do better than others",
    "desc": "If one thing outstrips another, it exceeds it or goes beyond it. ",
    "sentence": "She outstripped him in all the aspects of Computer Science."
  },
  {
    "word": "paean",
    "meaning": "speech of praise",
    "desc": "You can now use paean to mean any song of praise, regardless of the deity, or to mean a formal expression of praise, like a eulogy.",
    "sentence": "That was a deserved paean for that accomplished scientist."
  },
  {
    "word": "demur",
    "meaning": "being reluctant, politely reject",
    "desc": "Whether you object, politely disagree, or hesitate, you demur.",
    "sentence": "He demurred to go out in such cold night."
  },
  {
    "word": "qualify",
    "meaning": "limit to, restrain, add condition to it",
    "desc": "In one sense, it means to be right for, to measure up. In another sense, though, qualify means to change something slightly, to limit it or add a condition to it.",
    "sentence": "I'd like to qualify my last statement."
  },
  {
    "word": "amenable",
    "meaning": "easy to persuade, responsible",
    "desc": " If a person or thing is amenable to something, they are ready, willing, or responsive.",
    "sentence": "He is always amenable whenever playing cricket is a part of plan."
  },
  {
    "word": "commensurate",
    "meaning": "proportionate",
    "desc": "The word commensurate has to do with things that are similar in size and therefore appropriate.",
    "sentence": "He should get punishment commensurate with his crime."
  },
  {
    "word": "belie",
    "meaning": "misrepresent",
    "desc": "To belie means to contradict.",
    "sentence": "Though she is 53, her looks belie her age."
  },
  {
    "word": "mercurial",
    "meaning": "changing moods frequently, unpredictable",
    "desc": "Mercurial describes someone whose mood or behavior is changeable and unpredictable, or someone who is clever, lively, and quick.",
    "sentence": "I'm afraid of her mercurial nature. She is never predictable."
  },
  {
    "word": "maintain",
    "meaning": "to assert, to state",
    "desc": "",
    "sentence": "The king maintained the law to be valid."
  },
  {
    "word": "dirge",
    "meaning": "songs sung at funeral",
    "desc": "A dirge is a song of mourning, performed as a memorial to someone who’s died.",
    "sentence": "The dirge really helped the daughter in catharsis when she cried her heart out."
  },
  {
    "word": "connoisseur",
    "meaning": "a competent judge of something",
    "desc": "A connoisseur is a person who, through study and interest, has a fine appreciation for something.",
    "sentence": "Working in wine shop for years, he's truly a connoisseur of wine."
  },
  {
    "word": "plethora",
    "meaning": "abundance of something, excess",
    "desc": "If you have 15 different people who want to take you on a date, you have a plethora of romantic possibilities.",
    "sentence": "As a computer scientist, I have plethora of choices in jobs."
  },
  {
    "word": "precursor",
    "meaning": "preceding something",
    "desc": "A precursor is something that happens before something else.",
    "sentence": "Stone age was precursor to the bronze age."
  },
  {
    "word": "perfidy",
    "meaning": "treachery, betrayal",
    "desc": "In order for perfidy to happen, there has to have first been a sense of faith in place, which was then broken or betrayed.",
    "sentence": "I'll not condone that perfidy of yours! You'd be castigated for this."
  },
  {
    "word": "avarice",
    "meaning": "insatiable greed, desire to gain and hoard wealth",
    "desc": "Avarice is a fancy word for good old-fashioned greed.",
    "sentence": "Its rightly said: \"Avarice brings cataclysmic consequences.\". "
  },
  {
    "word": "cabal",
    "meaning": "secret conspiracy, to create secretive plots",
    "desc": "Cabal is a usually secret exclusive organization of individuals gathered for a political purpose.",
    "sentence": "I couldn't stop imagining being strapped to a table while a cabal of evil doctors removed my soul."
  },
  {
    "word": "facile",
    "meaning": "superficially impressive but lacking attention to actual complexities, speaking clearly and effectively",
    "desc": "If someone does something easily, or shows ease, it is described as facile in a good way, but if someone takes the easy way out and shows a lack of thought or care, it is facile in a bad way.",
    "sentence": "Being a new joiner, your project design is actually facile."
  },
  {
    "word": "patronize",
    "meaning": "to speak or behave in a way which seems friendly, but showing that you are superior in some way, to support & given money",
    "desc": "If you patronize a business, you shop there regularly. But if someone patronizes you, it's not so pleasant — they talk to you as if you were inferior or not very intelligent.",
    "sentence": "The male chauvinistic pig always patronizes women!"
  },
  {
    "word": "condescend",
    "meaning": "to agree to do something but showing that they are superior/better than other and should not be doing it, to patronize",
    "desc": "You can think of condescend as lowering yourself to do a task that you feel is far beneath you.",
    "sentence": "Kings and queens would never condescend to do their own laundry at the palace."
  },
  {
    "word": "equivocal",
    "meaning": "confused, uncertain, ambiguous",
    "desc": "If you ask your teacher what's on an upcoming test and she gives you an equivocal answer, you won't be able to narrow down your studying.",
    "sentence": "He was equivocal about the evening plans."
  },
  {
    "word": "supersede",
    "meaning": "To replace, become successor",
    "desc": "When something supersedes, it takes the place of something else.",
    "sentence": "The prince would obviously supersede the king."
  },
  {
    "word": "mores",
    "meaning": "traditions, customs",
    "desc": "Mores and morals have similar meanings — mores are the morals of a group or society itself.",
    "sentence": "I am always excited about mores in Indian weddings."
  },
  {
    "word": "officious",
    "meaning": "interfere, unnecessarily ready to offer advice, meddlesome, intrusive",
    "desc": "",
    "sentence": "You better not be officious in this matter!"
  },
  {
    "word": "peccadillo",
    "meaning": "a small misdeed, lacking judgement, unwise",
    "desc": "A peccadillo is a minor offense or sin.",
    "sentence": "You can condone his peccadillo."
  },
  {
    "word": "foible",
    "meaning": "minor weakness or slight peculiarity",
    "desc": "",
    "sentence": "Every human has certain foibles and peccadilloes."
  }
]